Repository: UselessJoy/moonraker
Catalog: moonraker/locales/*/LC_MESSAGES/moonraker.po
Languages: ru

source: Section [%s], Option 'type: %s': value must be one of the following choises: %s
ru: Секция [%s], параметр 'тип: %s': значение должно быть одним из следующих вариантов: %s

source: [%s]: Invalid value '%s' for option 'channel'. Type '%s' supports the following channels: %s. Falling back to channel '%s'
ru: [%s]: Недопустимое значение '%s' для параметра 'канал'. Тип '%s' поддерживает следующие каналы: %s. Возвращаемся к каналу '%s'

source: [%s]: Invalid virtualenv at path %s. Verify that the 'virtualenv' option is set to a valid virtualenv path.
ru: [%s]: Недопустимый путь к virtualenv по адресу %s. Убедитесь, что для параметра 'virtualenv' задано допустимый путь к virtualenv.

source: [%s]: Invalid python executable at %s. Verify that the 'virtualenv' option is set to a valid virtualenv path.
ru: [%s]: Недопустимый исполняемый файл python в %s. Убедитесь, что для параметра 'virtualenv' установлен допустимый путь к virtualenv.

source: [%s]: Moonraker is not permitted to restart service '%s'. To enable management of this service add %s to the bottom of the file %s. To disable management for this service set 'is_system_service: False' in the configuration for this section.
ru: [%s]: Moonraker не разрешено перезапускать службу '%s'.Чтобы разрешить управление этой службой, добавьте '%s' в нижнюю часть файла '%s'.Чтобы отключить управление для этой службы, установите "is_system_service: False" в конфигурациидля этого раздела.

source: [%s]: Option 'managed_services: %s' contains an invalid value '%s'. All values must be one of the following choices: %s
ru: [%s]: Параметр 'managed_services: %s' содержит недопустимое значение '%s'. Все значения должны быть одним из следующих вариантов: %s

source: Invalid path for option `%s` in section [%s]: Path `%s`
ru: Недопустимый путь для параметра '%s' в разделе [%s]: Путь '%s'

source: %s does not exist
ru: %s не существует

source: %s is not a file
ru: %s - это не файл

source: %s is not executable
ru: %s не является исполняемым файлом

source: Installing system dependencies...
ru: Установка системных зависимостей...

source: Error updating packages
ru: Ошибка при обновлении пакетов

source: Checking pip version...
ru: Проверяем версию pip...

source: Updating pip from version %s to %s...
ru: Обновление pip с версии %s до %s...

source: Pip Version Check Error: %s
ru: Ошибка проверки версии Pip: %s

source: Pip Version Check Error
ru: Ошибка проверки версии Pip

source: Updating python packages...
ru: Обновление пакетов python...

source: Error updating python requirements
ru: Ошибка при обновлении требований к python

source: The hours specified in 'refresh_window' must be between 0 and 23.
ru: Часы, указанные в поле 'refresh_window', должны быть в диапазоне от 0 до 23.

source: The start and end hours specified in 'refresh_window' cannot be the same.
ru: Часы начала и окончания, указанныев 'refresh_window', не могут совпадать.

source: The deprecated 'client_repo' and 'client_path' options have been removed. See Moonraker's configuration docs for details on client configuration.
ru: Устаревшие параметры 'client_repo' и 'client_path' были удалены. Подробности о конфигурации клиента см. в документации Moonraker по конфигурации.

source: [update_manager]: Extension %s already added
ru: [update_manager]: Расширение %s уже добавлено

source: Invalid type '%s' for section [%s]
ru: Недопустимый тип '%s' для раздела [%s]

source: [update_manager]: Failed to load extension %s: %s
ru: [update_manager]: Не удалось загрузить расширение %s: %s

source: Update Refused: Klippy is printing
ru: Обновление отклонено: Klippy печатает

source: Object %s is currently being updated
ru: Объект %s в настоящее время обновляется

source: Updater %s not available
ru: Программа обновления %s недоступна

source: Error updating %s: %s
ru: Ошибка обновления %s: %s

source: Full Update Complete
ru: Полное обновление завершено

source: Error on full updating: %s
ru: Ошибка при полном обновлении: %s

source: Recovery Attempt Refused: Klippy is printing
ru: Попытка восстановления отклонена: Klippy печатает

source: Upater %s is not a Git Repo Type
ru: Upater %s не является типом репозитория Git

source: Error Recovering %s
ru: Ошибка восстановления %s

source: No updater registered for '%s'
ru: Программа обновления для '%s' не зарегистрирована

source: Server is busy, cannot perform refresh
ru: Сервер занят, не удается выполнить обновление

source: Rollback Attempt Refused: Klippy is printing
ru: Попытка отката отклонена: Klippy печатает

source: Error Rolling Back %s
ru: Ошибка отката %s

source: %s KiB / %s KiB
ru: %s КБ / %s КБ

source: Downloading %s: %s [%s%]
ru: Загрузка %s: %s [%s%]

source: Multiple instances of Moonraker have the update manager enabled. %s
ru: Во многих экземплярах Moonraker включен диспетчер обновлений. %s

source: [%s]: Value for option 'commit' must be a minimum of 8 characters.
ru: [%s]: Значение параметра 'фиксация' должно содержать не менее 8 символов.

source: Update aborted, repo not valid
ru: Обновление прервано, репозиторий недействителен

source: Update aborted, repo has been modified
ru: Обновление прервано, репозиторий был изменен

source: Updating Application %s...
ru: Обновление приложения %s...

source: Update Finished...
ru: Обновление завершено...

source: Attempting Repo Recovery...
ru: Попытка восстановления репозитория...

source: Resetting Git Repo...
ru: Сброс Git-репозитория...

source: Recovery attempt failed, repo state not pristine
ru: Попытка восстановления не удалась, состояние хранилища изменено

source: Reinstall Complete
ru: Переустановка завершена

source: Rollback Complete
ru: Откат завершен

source: Rollback not performed
ru: Откат не выполнен

source: Updating Repo...
ru: Обновление репозитория...

source: Repo has diverged, attempting git reset
ru: Репозиторий отклонился, пытаясь сбросить git

source: Manually restore via SSH with the following commands:sudo service %s stopcd %srm -rf %sgit clone %ssudo service %s start
ru: Восстановите вручную по SSH с помощью следующих команд: sudo service %s stop cd %s rm -rf %s git clone %s sudo service %s start

source: Resolve by manually checking out a branch via SSH.
ru: Решите проблему, вручную проверив ветку по SSH.

source: Defaulting to previously tracked %s.
ru: Значение по умолчанию для ранее отслеживаемых %s.

source: Git Repo %s: Origin URL does not not match configured 'moved_origin'option. Expected: %s
ru: Git репозиторий %s: Исходный URL-адрес не соответствует настроенному параметру 'moved_origin'. Ожидается: %s

source: Git Repo %s: Initialization failure
ru: Git репозиторий %s: Ошибка инициализации

source: Pinned Commit %s does not exist
ru: Закрепленная фиксация %s не существует

source: Repo is corrupt
ru: Ошибка репозитория

source: Failed to detect git branch
ru: Не удалось обнаружить ветвь git

source: Failed to detect tracking remote for branch %s
ru: Не удалось обнаружить удаленное отслеживание для ветки %s

source: Failed to detect repo url
ru: Не удалось обнаружить URL-адрес репозитория

source: Unofficial remote url: %s. Official url is: %s
ru: Неофициальный удаленный url: %s. Официальный url: %s

source: Repo not on offical remote/branch, expected: origin/%s, detected: %s/%s
ru: Репозиторий не на официальной ветке, ожидалось: origin/%s, обнаружено: %s/%s

source: Repo has untracked source files: %s
ru: В репозитории есть неотслеживаемые исходные файлы: %s

source: Repo has diverged from remote
ru: Репозиторий отошел от удаленного

source: Repo is dirty. Detected the following modifed files: %s
ru: Репозиторий поврежден. Обнаружены следующие измененные файлы: %s

source: Git Repo %s: No warnings detected
ru: Репозиторий %s: Никаких предупреждений не обнаружено

source: Git Repo %s: Warnings detected:
ru: Репозиторий %s: Обнаружены предупреждения:

source: Git Repo %s: repo not initialized
ru: Репозиторий %s: репозиторий неинициализирован

source: Git Repo %s: No valid git remote detected
ru: Репозиторий %s: Не найдены действительные удаленные репозитории

source: Cannot reset, unknown remote/branch
ru: Не удается сбросить, неизвестная удаленная ветка

source: Git Repo %s: Cannot perform pull on a detached HEAD
ru: Репозиторий %s: Не удается выполнить вытягивание отделяемого HEAD

source: Failed to run git-config
ru: Не удалось выполнить git-config

source: Cannot clone git repo %s, it is a %s of another git repo.
ru: Не удалось скопировать репозиторий %s, это %s или иной репозиторий.

source: Recovery url has not been detected, clone aborted
ru: URL-адрес для восстановления не обнаружен, клонирование прервано

source: Git Repo %s: Starting Clone Recovery...
ru: Репозиторий %s: Запускаю восстановление...

source: Git Repo %s: Git Clone Failed
ru: Репозиторий %s: клонирование репозитория завершилось с ошибкой

source: Git Clone Error
ru: Ошибка клонирования репозитория

source: Git Repo %s: Git Clone Complete
ru: Репозиторий %s: клонирование репозитория завершилось успешно

source: Git Repo %s: Moving HEAD to previous commit %s
ru: Репозиторий %s: Перемещаю HEAD к предыдущему коммиту %s

source: Incomplete rollback data stored, cannot rollback
ru: Сохраненные неполные данные для отката, откат невозможен

source: Failed to find remote for primary branch '%s'
ru: Не удалось найти удаленный сервер для основной ветки '%s'

source: Attempting to repair loose objects...
ru: Пытаюсь починить незакрепленные предметы...

source: Attempt to repair loose objects failed, hard recovery is required
ru: Попытка восстановления потерянных объектов не удалась, Требуется полное восстановление

source: Loose objects repaired
ru: Потерянные объекты восстановленны

source: Unable to repair loose objects, use hard recovery
ru: Не удалось восстановить потерянные объекты, используйте полное восстановление

source: Git Command '%s' failed
ru: Git команда '%s' завершилась с ошибкой

source: Timeout while connecting
ru: Тайм-аут при подключении
